func.func @main(%arg0: tensor<800x900xf32>, %arg1: tensor<800x1000xf32>, %arg2: tensor<1000x900xf32>, %arg3: tensor<900x1100xf32>, %arg4: tensor<900x1200xf32>, %arg5: tensor<1200x1100xf32>, %arg6: tensor<800x1100xf32>) -> tensor<800x1100xf32> {
  %0 = stablehlo.dot %arg1, %arg2 : (tensor<800x1000xf32>, tensor<1000x900xf32>) -> tensor<800x900xf32>
  %1 = stablehlo.dot %arg4, %arg5 : (tensor<900x1200xf32>, tensor<1200x1100xf32>) -> tensor<900x1100xf32>
  %2 = stablehlo.dot %0, %1 : (tensor<800x900xf32>, tensor<900x1100xf32>) -> tensor<800x1100xf32>
  return %2 : tensor<800x1100xf32>
}
