func.func @main(%arg0: tensor<1600x1800xf64>, %arg1: tensor<1600x2000xf64>, %arg2: tensor<2000x1800xf64>, %arg3: tensor<1800x2200xf64>, %arg4: tensor<1800x2400xf64>, %arg5: tensor<2400x2200xf64>, %arg6: tensor<1600x2200xf64>) -> tensor<1600x2200xf64> {
  %0 = stablehlo.dot %arg1, %arg2 : (tensor<1600x2000xf64>, tensor<2000x1800xf64>) -> tensor<1600x1800xf64>
  %1 = stablehlo.dot %arg4, %arg5 : (tensor<1800x2400xf64>, tensor<2400x2200xf64>) -> tensor<1800x2200xf64>
  %2 = stablehlo.dot %0, %1 : (tensor<1600x1800xf64>, tensor<1800x2200xf64>) -> tensor<1600x2200xf64>
  return %2 : tensor<1600x2200xf64>
}
